{"modelTopology":{"class_name":"Model","config":{"name":"catan_net","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,865],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"shared_dense_0","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"shared_dense_0","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"shared_bn_0","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"shared_bn_0","trainable":true},"inbound_nodes":[[["shared_dense_0",0,0,{}]]]},{"name":"shared_dense_1","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"shared_dense_1","trainable":true},"inbound_nodes":[[["shared_bn_0",0,0,{}]]]},{"name":"shared_bn_1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"shared_bn_1","trainable":true},"inbound_nodes":[[["shared_dense_1",0,0,{}]]]},{"name":"shared_dense_2","class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"shared_dense_2","trainable":true},"inbound_nodes":[[["shared_bn_1",0,0,{}]]]},{"name":"shared_bn_2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"shared_bn_2","trainable":true},"inbound_nodes":[[["shared_dense_2",0,0,{}]]]},{"name":"policy_dense","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy_dense","trainable":true},"inbound_nodes":[[["shared_bn_2",0,0,{}]]]},{"name":"value_dense","class_name":"Dense","config":{"units":128,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value_dense","trainable":true},"inbound_nodes":[[["shared_bn_2",0,0,{}]]]},{"name":"policy_output","class_name":"Dense","config":{"units":255,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"policy_output","trainable":true},"inbound_nodes":[[["policy_dense",0,0,{}]]]},{"name":"value_output","class_name":"Dense","config":{"units":1,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"uniform","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"value_output","trainable":true},"inbound_nodes":[[["value_dense",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["policy_output",0,0],["value_output",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"shared_dense_0/kernel","shape":[865,256],"dtype":"float32"},{"name":"shared_dense_0/bias","shape":[256],"dtype":"float32"},{"name":"shared_bn_0/gamma","shape":[256],"dtype":"float32"},{"name":"shared_bn_0/beta","shape":[256],"dtype":"float32"},{"name":"shared_dense_1/kernel","shape":[256,256],"dtype":"float32"},{"name":"shared_dense_1/bias","shape":[256],"dtype":"float32"},{"name":"shared_bn_1/gamma","shape":[256],"dtype":"float32"},{"name":"shared_bn_1/beta","shape":[256],"dtype":"float32"},{"name":"shared_dense_2/kernel","shape":[256,256],"dtype":"float32"},{"name":"shared_dense_2/bias","shape":[256],"dtype":"float32"},{"name":"shared_bn_2/gamma","shape":[256],"dtype":"float32"},{"name":"shared_bn_2/beta","shape":[256],"dtype":"float32"},{"name":"policy_dense/kernel","shape":[256,128],"dtype":"float32"},{"name":"policy_dense/bias","shape":[128],"dtype":"float32"},{"name":"value_dense/kernel","shape":[256,128],"dtype":"float32"},{"name":"value_dense/bias","shape":[128],"dtype":"float32"},{"name":"policy_output/kernel","shape":[128,255],"dtype":"float32"},{"name":"policy_output/bias","shape":[255],"dtype":"float32"},{"name":"value_output/kernel","shape":[128,1],"dtype":"float32"},{"name":"value_output/bias","shape":[1],"dtype":"float32"},{"name":"shared_bn_0/moving_mean","shape":[256],"dtype":"float32"},{"name":"shared_bn_0/moving_variance","shape":[256],"dtype":"float32"},{"name":"shared_bn_1/moving_mean","shape":[256],"dtype":"float32"},{"name":"shared_bn_1/moving_variance","shape":[256],"dtype":"float32"},{"name":"shared_bn_2/moving_mean","shape":[256],"dtype":"float32"},{"name":"shared_bn_2/moving_variance","shape":[256],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}